Revit 2026 API

# UpdaterData Class

---

Service class that is passed to an Updater to prove access to update execution context

SystemObject Autodesk.Revit.DBUpdaterData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UpdaterData : IDisposable
```
```vb
Public Class UpdaterData
	Implements IDisposable
```
```cpp
public ref class UpdaterData : IDisposable
```
```fsharp
type UpdaterData =
    class
        interface IDisposable
    end
```

The UpdaterData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the UpdaterData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAddedElementIds | Returns set of elements newly added to the document. This set is mutually exclusive of elements returned by getDeletedElementIds() and getModifiedElementIds(). |
|  | GetDeletedElementIds | Returns set of elements that were deleted from the document. This set is mutually exclusive of elements returned by getAddedElementIds() and getModifiedElementIds(). |
|  | GetDocument | Returns document associated with this UpdaterData |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModifiedElementIds | Returns set of elements that were modified. This set is mutually exclusive of elements returned by getAddedElementIds() and getDeletedElementIds(). |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsChangeTriggered | Allows updater to check if specific change has happened to an element. Compares input type to the types that caused Updater::execute() to be triggered. If input type was not registered as a trigger for the associated Updater, this method will always return false for that ChangeType. For example, if the only trigger registered for UpdaterX is ChangeTypeAny for Element A, then passing in ChangeTypeGeometry will return false even if the geometry of A changed because the registered trigger was ChangeTypeAny. However, passing in ChangeTypeAny will return true. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace